import requests
import pandas as pd
import get_data as gd

from bs4 import BeautifulSoup

Nantou = ['南投縣南投市', '南投縣名間鄉', '南投縣埔里鎮', '南投縣水里鄉', '南投縣竹山鎮', '南投縣草屯鎮']

Taichung = ['台中市中區', '台中市北區', '台中市北屯區', '台中市南區', '台中市南屯區', '台中市后里區', '台中市大甲區', '台中市大肚區', '台中市大里區', '台中市大雅區',
            '台中市太平區', '台中市東勢區', '台中市東區', '台中市梧棲區', '台中市沙鹿區', '台中市清水區', '台中市潭子區', '台中市烏日區', '台中市西區', '台中市西屯區', '台中市豐原區', '台中市霧峰區', '台中市龍井區']

Taipe = ['台北市中山區', '台北市中正區', '台北市信義區', '台北市內湖區', '台北市北投區', '台北市南港區', '台北市士林區', '台北市大同區', '台北市大安區', '台北市文山區', '台北市松山區', '台北市萬華區']

Tainan = ['台南市下營區', '台南市中西區', '台南市仁德區', '台南市佳里區', '台南市六甲區', '台南市北區', '台南市南區', '台南市善化區', '台南市學甲區', '台南市安南區',
          '台南市安平區', '台南市新化區', '台南市新市區', '台南市新營區', '台南市東區', '台南市歸仁區', '台南市永康區', '台南市白河區', '台南市關廟區', '台南市鹽水區', '台南市麻豆區']

Taitung = ['台東縣台東市', '台東縣成功鎮']

Chiayi = ['嘉義市東區', '嘉義市西區']

Chiayi2 = ['嘉義縣大林鎮', '嘉義縣太保市', '嘉義縣朴子市', '嘉義縣民雄鄉', '嘉義縣水上鄉']

Keelung = ['基隆市七堵區', '基隆市中正區', '基隆市仁愛區', '基隆市信義區', '基隆市安樂區', '基隆市暖暖區']

Yilan = ['宜蘭縣宜蘭市', '宜蘭縣礁溪鄉', '宜蘭縣羅東鎮', '宜蘭縣蘇澳鎮', '宜蘭縣頭城鎮']

Pingtung = ['屏東縣內埔鄉', '屏東縣屏東市', '屏東縣恆春鎮', '屏東縣東港鎮', '屏東縣枋寮鄉', '屏東縣潮州鎮', '屏東縣萬丹鄉', '屏東縣里港鄉', '屏東縣高樹鄉', '屏東縣鹽埔鄉']

Changhua = ['彰化縣二林鎮', '彰化縣北斗鎮', '彰化縣和美鎮', '彰化縣員林市', '彰化縣彰化市', '彰化縣永靖鄉', '彰化縣溪湖鎮', '彰化縣田中鎮', '彰化縣社頭鄉', '彰化縣花壇鄉', '彰化縣鹿港鎮']

New_Taipei = ['新北市三峽區', '新北市三芝區', '新北市三重區', '新北市中和區', '新北市五股區', '新北市八里區', '新北市土城區', '新北市新店屈', '新北市新莊區', '新北市板橋區',
              '新北市林口區', '新北市樹林區', '新北市永和區', '新北市汐止區', '新北市泰山區', '新北市淡水區', '新北市深坑區', '新北市瑞芳區', '新北市蘆洲區', '新北市金山區', '新北市鶯歌區']

Hsinchu = ['新竹縣新埔鎮', '新竹縣新豐鄉', '新竹縣湖口鄉', '新竹縣竹北市', '新竹縣竹東鎮', '新竹縣關西鎮']

Taoyuan = ['桃園市中壢區', '桃園市八德區', '桃園市大園區', '桃園市大溪區', '桃園市平鎮區', '桃園市新屋區', '桃園市桃園區', '桃園市楊梅區', '桃園市蘆竹區', '桃園市觀音區', '桃園市龍潭區', '桃園市龜山區']

Penghu = ['澎湖縣馬公市']

Hualien = ['花蓮縣吉安鄉', '花蓮縣玉里鎮', '花蓮縣花蓮市']

Miaoli = ['苗栗縣公館鄉', '苗栗縣卓蘭鎮', '苗栗縣後龍鎮', '苗栗縣竹南鎮', '苗栗縣苑裡鎮', '苗栗縣苗栗市', '苗栗縣通霄鎮', '苗栗縣銅鑼鄉', '苗栗縣頭份市']

Kinmen = ['金門縣金城鎮', '金門縣金湖鎮']

Yunlin = ['雲林縣北港鎮', '雲林縣斗六市', '雲林縣斗南鎮', '雲林縣莿桐鄉', '雲林縣虎尾鎮', '雲林縣西螺鎮', '雲林縣麥寮鄉'] 

Kaohsiung = ['高雄市三民區' , '高雄市仁武區', '高雄市前鎮區', '高雄市大寮區', '高雄市大樹區', '高雄市大社區', '高雄市小港區',
             '高雄市岡山區', '高雄市左營區', '高雄市新興區', '高雄市旗山區', '高雄市旗津區', '高雄市林園區', '高雄市楠梓區',
             '高雄市橋頭區', '高雄市美濃區', '高雄市苓雅區', '高雄市路竹區', '高雄市阿蓮區', '高雄市鳳山區', '高雄市鹽埕區', '高雄市鼓山區']

result = [
    {
        "City": '南投縣',
        "Area": Nantou
    },

    {
        "City": '台中市',
        "Area": Taichung
    },

    {
        "City": '台北市',
        "Area": Taipe
    },

    {
        "City": '台南市',
        "Area": Tainan
    },
    
    {
        "City": '台東縣',
        "Area": Taitung
    },

    {
        "City": '嘉義市',
        "Area": Chiayi
    },

    {
        "City": '嘉義縣',
        "Area": Chiayi2
    },

    {
        "City": '基隆市',
        "Area": Keelung
    },

    {
        "City": '宜蘭縣',
        "Area": Yilan
    },

    {
        "City": '屏東縣',
        "Area": Pingtung
    },

    {
        "City": '彰化縣',
        "Area": Changhua
    },

    {
        "City": '新北市',
        "Area": New_Taipei
    },

    {
        "City": '新竹縣',
        "Area": Hsinchu
    },

    {
        "City": '桃園市',
        "Area": Taoyuan
    },

    {
        "City": '澎湖縣',
        "Area": Penghu
    },

    {
        "City": '花蓮縣',
        "Area": Hualien
    },

    {
        "City": '苗栗縣',
        "Area": Miaoli
    },

    {
        "City": '金門縣',
        "Area": Kinmen
    },

    {
        "City": '雲林縣',
        "Area": Yunlin
    },

    {
        "City": '高雄市',
        "Area": Kaohsiung
    }
]

headers = {"User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/99.0.4844.82 Safari/537.36"}

gd.Get_Data(result, headers)