import get_data as gd

Taipe = ['中正區', '大同區', '中山區', '松山區', '大安區', '萬華區', '信義區', '士林區', '北投區', '內湖區', '南港區', '文山區']

Keelung = ['仁愛區', '信義區', '中正區', '暖暖區', '七堵區']

New_Taipei = ['金山區', '板橋區', '汐止區', '深坑區', '石碇區', '瑞芳區', '新店區', '永和區', '中和區', '土城區', '三峽區', '樹林區', 
              '鶯歌區', '三重區', '新莊區', '泰山區', '林口區', '蘆洲區', '五股區', '八里區', '淡水區', '三芝區', '石門區']

Yilan = ['宜蘭市', '頭城鎮', '礁溪鄉', '員山鄉', '羅東鎮', '三星鄉', '五結鄉', '蘇澳鎮']

Hsinchu = ['竹北市', '湖口鄉', '新豐鄉', '新埔鎮', '關西鎮', '芎林鄉', '寶山鄉', '竹東鎮', '尖石鄉']

Taoyuan = ['中壢區', '平鎮區', '龍潭區', '楊梅區', '新屋區', '觀音區', '桃園區', '龜山區', '八德區', '大溪區', '復興區', '大園區', '蘆竹區']

Miaoli = ['竹南鎮', '頭份市', '後龍鎮', '通霄鎮', '苑裡鎮', '苗栗市', '公館鄉', '大湖鄉', '泰安鄉', '銅鑼鄉', '三義鄉']

Taichung = ['中區', '東區', '南區', '西區', '北區', '北屯區', '西屯區', '南屯區', '太平區',
            '大里區', '霧峰區', '烏日區', '豐原區', '后里區', '石岡區', '東勢區', '新社區',
            '潭子區', '大雅區', '神岡區', '大肚區', '沙鹿區', '龍井區', '梧棲區', '清水區', '大甲區', '外埔區']

Changhua = ['彰化市', '花壇鄉', '鹿港鎮', '福興鄉', '線西鄉', '和美鎮', '員林市', '社頭鄉',
            '永靖鄉', '溪湖鎮', '埔鹽鄉', '田中鎮', '北斗鎮', '埤頭鄉', '溪州鄉', '二林鎮']

Nantou = ['南投市', '中寮鄉', '草屯鎮', '國姓鄉', '埔里鎮', '名間鄉', '集集鎮', '水里鄉', '竹山鎮', '鹿谷鄉']

Chiayi = ['番路鄉', '梅山鄉', '竹崎鄉', '中埔鄉', '水上鄉', '太保市', '朴子市', '東石鄉', '新港鄉', '民雄鄉', '大林鎮', '布袋鎮']

Yunlin = ['大埤鄉', '虎尾鎮', '土庫鎮', '台西鄉', '崙背鄉', '麥寮鄉', '斗六市', '古坑鄉', '莿桐鄉', '北港鎮', '四湖鄉']

Tainan = ['中西區', '東區', '南區', '北區', '安平區', '安南區', '永康區', '歸仁區', '新化區',
          '玉井區', '楠西區', '南化區', '仁德區', '關廟區', '龍崎區', '官田區', '麻豆區',
          '佳里區', '七股區', '將軍區', '北門區', '新營區', '後壁區', '白河區', '東山區', '安定區']

Kaohsiung = ['新興區', '前金區', '苓雅區', '鼓山區', '旗津區', '前鎮區', '三民區', '楠梓區', '小港區',
             '左營區', '仁武區', '大社區', '岡山區', '路竹區', '阿蓮區', '燕巢區', '橋頭區', '梓官區',
             '永安區', '湖內區', '鳳山區', '大寮區', '林園區', '鳥松區', '大樹區', '美濃區', '杉林區']

Pingtung = ['屏東市', '鹽埔鄉', '長治鄉', '內埔鄉', '萬丹鄉', '潮州鎮', '萬巒鄉', '林邊鄉',
            '東港鎮', '新園鄉', '枋寮鄉', '枋山鄉', '車城鄉', '牡丹鄉', '恆春鎮']

Kinmen = ['金湖鎮']

Hsinchu2 = ['東區', '北區', '香山區']

Chiayi2 = ['東區', '西區']

result = [
    {
        "City": "台北市",
        "Area": Taipe
    },

    {
        "City": "基隆市",
        "Area": Keelung
    },

    {
        "City": "新北市",
        "Area": New_Taipei
    },

    {
        "City": "宜蘭縣",
        "Area": Yilan
    },

    {
        "City": "新竹縣",
        "Area": Hsinchu
    },

    {
        "City": "桃園市",
        "Area": Taoyuan
    },

    {
        "City": "苗栗縣",
        "Area": Miaoli
    },

    {
        "City": "台中市",
        "Area": Taichung
    },

    {
        "City": "彰化縣",
        "Area": Changhua
    },

    {
        "City": "南投縣",
        "Area": Nantou
    },

    {
        "City": "嘉義縣",
        "Area": Chiayi
    },

    {
        "City": "雲林縣",
        "Area": Yunlin
    },

    {
        "City": "台南市",
        "Area": Tainan
    },

    {
        "City": "高雄市",
        "Area": Kaohsiung
    },

    {
        "City": "屏東縣",
        "Area": Pingtung
    },

    {
        "City": "金門縣",
        "Area": Kinmen
    },

    {
        "City": "新竹市",
        "Area": Hsinchu2
    },

    {
        "City": "嘉義市",
        "Area": Chiayi2
    }
]


headers = {"User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/99.0.4844.82 Safari/537.36"}


gd.Get_Data(result)





